In [1]:
import pandas as pd
import numpy as np

In [2]:
#What is a dataframe-It is a 2-D data structure with 3 principal
#components i.e Rows,Columns and Values. Datas are aligned in a 
#tabular fashion in rows and columns.

In [6]:
#create a Dataframe from clipboard
age_df = pd.read_clipboard()
print(age_df)

  First name    Last name  Age
0       Tinu     Elejogun   14
1      Marek  Kostrzewski   25
2       Lily    McGarrett   18
3  Olatunkbo     Chijiaku   22
4   Adrienne     Anthoula   22
5     Axelia   Athanasios   22
6  Jon-Kabat         Zinn   22
7    Thabang        Mosoa   15
8   Kgaogelo        Mosoa   11

In [7]:
#display column names
age_df.columns

Index(['First name', 'Last name', 'Age'], dtype='object')

In [8]:
#access one or more columns
#one column
age_df['First name']

0         Tinu
1        Marek
2         Lily
3    Olatunkbo
4     Adrienne
5       Axelia
6    Jon-Kabat
7      Thabang
8     Kgaogelo
Name: First name, dtype: object

In [9]:
#more column
age_df[['First name', 'Age']]

  First name  Age
0       Tinu   14
1      Marek   25
2       Lily   18
3  Olatunkbo   22
4   Adrienne   22
5     Axelia   22
6  Jon-Kabat   22
7    Thabang   15
8   Kgaogelo   11

In [10]:
#NAN Value - Whenever a value is not present or missing in a 
#table, bth values are considered NAN value.
age_df['rank'] = np.nan
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   NaN
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22   NaN
4   Adrienne     Anthoula   22   NaN
5     Axelia   Athanasios   22   NaN
6  Jon-Kabat         Zinn   22   NaN
7    Thabang        Mosoa   15   NaN
8   Kgaogelo        Mosoa   11   NaN

In [11]:
#head and tail functions
#head function - it prints out the first five rows of the data
age_df.head()

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   NaN
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22   NaN
4   Adrienne     Anthoula   22   NaN

In [12]:
#tail function- it print out the last five rows of the data
age_df.tail()

  First name   Last name  Age  rank
4   Adrienne    Anthoula   22   NaN
5     Axelia  Athanasios   22   NaN
6  Jon-Kabat        Zinn   22   NaN
7    Thabang       Mosoa   15   NaN
8   Kgaogelo       Mosoa   11   NaN

In [16]:
#Assign values to a dataframe using 1.Numpy 2. Series
#1. Numpy
arr_1 = np.arange(2,20,2)
age_df['rank'] = arr_1
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14     2
1      Marek  Kostrzewski   25     4
2       Lily    McGarrett   18     6
3  Olatunkbo     Chijiaku   22     8
4   Adrienne     Anthoula   22    10
5     Axelia   Athanasios   22    12
6  Jon-Kabat         Zinn   22    14
7    Thabang        Mosoa   15    16
8   Kgaogelo        Mosoa   11    18

In [18]:
#2. Series
rank_series = pd.Series([0,10, 11, 12,15], index=[0,3,5,6,8])
age_df['rank'] = rank_series
print(age_df)

  First name    Last name  Age  rank
0       Tinu     Elejogun   14   0.0
1      Marek  Kostrzewski   25   NaN
2       Lily    McGarrett   18   NaN
3  Olatunkbo     Chijiaku   22  10.0
4   Adrienne     Anthoula   22   NaN
5     Axelia   Athanasios   22  11.0
6  Jon-Kabat         Zinn   22  12.0
7    Thabang        Mosoa   15   NaN
8   Kgaogelo        Mosoa   11  15.0

In [19]:
#Delete a column
del(age_df['Last name'])
print(age_df)

  First name  Age  rank
0       Tinu   14   0.0
1      Marek   25   NaN
2       Lily   18   NaN
3  Olatunkbo   22  10.0
4   Adrienne   22   NaN
5     Axelia   22  11.0
6  Jon-Kabat   22  12.0
7    Thabang   15   NaN
8   Kgaogelo   11  15.0

In [22]:
#convert a dictionary variables to a dataframe
sample_dict = {
    'company' : ['RPG', 'PMG' ],
    'profit' : [2000, 8000]
}
sample_df = pd.DataFrame(sample_dict)
print(sample_df)

  company  profit
0     RPG    2000
1     PMG    8000